src/cf/Enums/CRM_ВариантыПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВариантыПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СТАРТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПРОФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОРП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/CRM_ВариантыПоставки/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Если Параметры.СтрокаПоиска = "" Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
		КонецЕсли;
		ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
		ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
	Иначе
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() И СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.СТАРТ), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
		КонецЕсли;
		Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.ПРОФ), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
		КонецЕсли;
		Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.КОРП), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
